
TRIGGERS = {"джарвис", "djarvis", "чарльз"}

# Теперь значения — это имена функций-обработчиков (строки)
data_set = [
    {
        "phrases": ["найди", "найти", "поищи", "ищи", "поиск", "что такое", "кто такой", "узнай"],
        "handler": "web.search_web",
        "param": True
    },
    {
        "phrases": ["найди в википедии", "поиск в википедии", "википедия", "что такое википедия", "кто такой википедия", "узнай википедию", "расскажи о", "расскажи про", "расскажи что такое",],
        "handler": "wiki.search_wiki",
        "param": True
    },
    {
        "phrases": ["привет", "здравствуй", "доброе утро", "добрый день", "добрый вечер", "приветик", "приветствую", "здарова", "хай", "добрейшего времени суток"],
        "handler": "default.answers.simple.simple_answer",
        "param": False,
    },
    # ... и так далее для других команд
]
# data_set = {
#     ("привет", "здравствуй", "доброе утро", "добрый день", "добрый вечер", "приветик", "приветствую", "здарова", "хай", "добрейшего времени суток"): "default.answers.simple.simple_answer",
#     ("как дела", "как ты", "как жизнь", "как поживаешь", "как настроение", "как сам", "как у тебя дела", "как твои дела", "как твои успехи"): "default.answers.simple.simple_answer",
#     ("что ты умеешь", "что ты можешь", "что ты знаешь", "какие у тебя возможности", "что ты умеешь делать", "чем ты полезен", "что ты делаешь"): "default.answers.simple.simple_answer",
#     ("расскажи анекдот", "расскажи шутку", "расскажи прикол", "пошути", "смешной анекдот", "рассмеши меня", "анекдот", "шутка"): "default.answers.simple.simple_answer",
#     ("покажи погоду", "какая погода", "узнай погоду", "что на улице", "погода сейчас", "погода на сегодня", "погода за окном", "какая температура"): "weathers.get_weather",
#     ("покажи новости", "какие новости", "узнай новости", "новости сегодня", "что нового", "последние новости", "новости"): "news.get_news",
#     ("покажи время", "который час", "узнай время", "сколько времени", "время сейчас", "время", "текущее время"): "default.answers.simple.get_time",
#     ("покажи карту", "где я нахожусь", "узнай местоположение", "где я", "покажи где я", "местоположение", "локация"): "default.answers.simple.get_location",
#     ("включи свет", "включи лампу", "включи освещение", "зажги свет", "освещение включи", "лампу включи", "освещение", "лампа"): "default.answers.simple.turn_on_light",
#     ("выключи свет", "выключи лампу", "выключи освещение", "погаси свет", "освещение выключи", "лампу выключи", "выключи лампу", "выключи освещение"): "default.answers.simple.turn_off_light",
#     ("включи музыку", "включи песню", "поставь музыку", "давай музыку", "музыку включи", "музыку поставь", "музыку давай", "воспроизведи музыку", "музыку"): "default.answers.simple.play_music",
#     ("выключи музыку", "останови музыку", "прекрати музыку", "музыку выключи", "музыку останови", "музыку прекрати", "останови песню", "выключи песню"): "default.answers.simple.stop_music",
#     ("найди", "ищи", "поиск в интернете", "поиск", "что такое", "кто такой", "узнай"): "search_web",
#     ("найди в википедии", "поиск в википедии", "википедия", "что такое википедия", "кто такой википедия", "узнай википедию"): "wiki.search_wiki",
# }
# Функция для получения обработчика по ключевым словам
