# Теперь значения — это имена функций-обработчиков (строки)
SYSTEM_DATA = [
    {
        "phrases": ['отключись', 'на сегодня хватит', 'хватит на сегодня', 'хватит', 'отключись пожалуйста', 'отключись на сегодня', 'на сегодня хватит'],
        "handler": "default.windows.exit_programm.exit_handle",
        "param": False,
    }
]

GREATER_DATA = [
    {
        "phrases": ["привет", "здравствуй", "доброе утро", "добрый день", "добрый вечер", "приветик", "приветствую", "здарова", "хай", "добрейшего времени суток"],
        "handler": "default.answers.simple.simple_answer",
        "param": False,
        "text": "Привет! Чем могу помочь?"
    },
]

SEARCH_DATA = [
    {
        "phrases": ["найди", "найти", "поищи", "ищи", "поиск", "что такое", "кто такой", "узнай"],
        "handler": "web.search_web",
        "param": True,
        "text": "Ищу информацию в интернете..."
    },
    {
        "phrases": ["найди в википедии", "поиск в википедии", "википедия", "что такое википедия", "кто такой википедия", "узнай википедию", "расскажи о", "расскажи про", "расскажи что такое",],
        "handler": "wiki.search_wiki",
        "param": True,
        "text": "Сейчас посмотрю в Википедии..."
    },
]

APPS_DATA = [
    # Telegram
    {
        "phrases": ["открой телеграм", "запусти телеграм", "запусти телеграф", "открой телеграф"],
        "handler": "apps.telegram.open_telegram",
        "param": False,
    },
    {
        "phrases": ["закрой телеграм", "выключи телеграм", "закрой телеграф", "выключи телеграф"],
        "handler": "apps.telegram.close_telegram",
        "param": False,
        "text": "Закрываю приложение..."
    },
    # Notepad
     {
        "phrases": ["открой блокнот", "запусти блокнот", "запусти ноутпад", "открой ноутпад"],
        "handler": "apps.notepad.open_notepad",
        "param": False,
    },
    {
        "phrases": ["закрой блокнот", "выключи блокнот", "закрой ноутпад", "выключи ноутпад"],
        "handler": "apps.notepad.close_notepad",
        "param": False,
        "text": "Закрываю приложение..."
    },
    # Browser
    {
        "phrases": ["открой гугл", "запусти гугл", "запусти хром", "открой хром", "открой браузер", "запусти браузер"],
        "handler": "apps.browser.open_browser",
        "param": False,
    },
    {
        "phrases": ["закрой гугл", "выключи гугл", "закрой хром", "выключи хром", "закрой браузер", "выключи браузер"],
        "handler": "apps.browser.close_browser",
        "param": False,
        "text": "Закрываю приложение..."
    },
    # Music
        {
        "phrases": ["открой музыку", "запусти музыку", "запусти музыку", "открой музыку", "открой музыку", "запусти музыку", "включи музыку", "включи песню", "поставь музыку", "давай музыку", "музыку включи", "музыку поставь", "музыку давай", "воспроизведи музыку"],
        "handler": "apps.music.open_music",
        "param": False,
    },
    {
        "phrases": ["закрой музыку", "выключи музыку", "закрой музыку", "закрой музыку", "останови музыку", "прекрати музыку", "музыку выключи", "музыку останови", "музыку прекрати", "останови песню", "выключи песню"],
        "handler": "apps.music.close_music",
        "param": False,
        "text": "Закрываю приложение..."
    },
]

data_set = []
data_set += SYSTEM_DATA
data_set += GREATER_DATA
data_set += SEARCH_DATA
data_set += APPS_DATA



# data_set = {
#     ("привет", "здравствуй", "доброе утро", "добрый день", "добрый вечер", "приветик", "приветствую", "здарова", "хай", "добрейшего времени суток"): "default.answers.simple.simple_answer",
#     ("как дела", "как ты", "как жизнь", "как поживаешь", "как настроение", "как сам", "как у тебя дела", "как твои дела", "как твои успехи"): "default.answers.simple.simple_answer",
#     ("что ты умеешь", "что ты можешь", "что ты знаешь", "какие у тебя возможности", "что ты умеешь делать", "чем ты полезен", "что ты делаешь"): "default.answers.simple.simple_answer",
#     ("расскажи анекдот", "расскажи шутку", "расскажи прикол", "пошути", "смешной анекдот", "рассмеши меня", "анекдот", "шутка"): "default.answers.simple.simple_answer",
#     ("покажи погоду", "какая погода", "узнай погоду", "что на улице", "погода сейчас", "погода на сегодня", "погода за окном", "какая температура"): "weathers.get_weather",
#     ("покажи новости", "какие новости", "узнай новости", "новости сегодня", "что нового", "последние новости", "новости"): "news.get_news",
#     ("покажи время", "который час", "узнай время", "сколько времени", "время сейчас", "время", "текущее время"): "default.answers.simple.get_time",
#     ("покажи карту", "где я нахожусь", "узнай местоположение", "где я", "покажи где я", "местоположение", "локация"): "default.answers.simple.get_location",
#     ("включи свет", "включи лампу", "включи освещение", "зажги свет", "освещение включи", "лампу включи", "освещение", "лампа"): "default.answers.simple.turn_on_light",
#     ("выключи свет", "выключи лампу", "выключи освещение", "погаси свет", "освещение выключи", "лампу выключи", "выключи лампу", "выключи освещение"): "default.answers.simple.turn_off_light",
#     ("включи музыку", "включи песню", "поставь музыку", "давай музыку", "музыку включи", "музыку поставь", "музыку давай", "воспроизведи музыку", "музыку"): "default.answers.simple.play_music",
#     ("выключи музыку", "останови музыку", "прекрати музыку", "музыку выключи", "музыку останови", "музыку прекрати", "останови песню", "выключи песню"): "default.answers.simple.stop_music",
#     ("найди", "ищи", "поиск в интернете", "поиск", "что такое", "кто такой", "узнай"): "search_web",
#     ("найди в википедии", "поиск в википедии", "википедия", "что такое википедия", "кто такой википедия", "узнай википедию"): "wiki.search_wiki",
# }
# Функция для получения обработчика по ключевым словам
